In [11]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### Read Data

In [12]:
# Opponent group letter 
group = 'M'

anon = pd.read_csv(f'anon_data_gaston.csv')
public_reg = pd.read_excel(f'public_data_register{group}.xlsx')
public_results = pd.read_excel(f'public_data_results{group}.xlsx')
# survey_list = pd.read_excel(f'survey_list{group}.xlsx')  # leaked names

print("Anon:", anon.shape)
print("Register:", public_reg.shape)
# print("Survey list:", survey_list.shape)

Anon: (200, 8)
Register: (1495, 7)

In [13]:
anon.head()

,sex,evote,zip,education,citizenship,marital_status,party,age_band
0,Female,0,2400,Higher education,Other,Never married,Green,50-59
1,Female,0,2300,Primary education,Other,Married/separated,Red,70+
2,Male,1,2100,Primary education,Denmark,Never married,Green,18-29
3,Female,0,2200,Secondary education,Denmark,Married/separated,Red,50-59
4,Female,0,2400,Secondary education,Denmark,Married/separated,Green,70+

In [14]:
public_reg.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted
0,"Carter, Celeste",Female,2004-05-26,2100,Denmark,Never married,2
1,"Vallie, Alexander",Male,2000-06-21,2300,Denmark,Never married,1
2,"Juarez-Cervantes, Bryanna",Female,1999-02-26,2100,Denmark,Married/separated,1
3,"el-Musa, Shaamikh",Male,2000-06-27,2200,Austria,Never married,2
4,"Mikalson, Amber Lee",Female,2003-02-07,2400,Denmark,Never married,1

In [ ]:
survey_list.head()